In [1]:
import numpy as np
import pandas as pd

In [2]:
#Criação do dataframe
dados = {
    'Nome': ['Maria', 'Joao','Ana','Pedro','Joao'],
    'Categoria':['A','B','A','B','B'],
    'Vendas':[100,200,150,250,350]
}
df = pd.DataFrame(dados)
df.head()

    Nome Categoria  Vendas
0  Maria         A     100
1   Joao         B     200
2    Ana         A     150
3  Pedro         B     250
4   Joao         B     350

In [8]:
#Usando metodo groupby, usado para resumir
#Exemplo para agrupar categoria com venda e soma-los
df_agrupado = df.groupby('Categoria')['Vendas'].sum()
df_agrupado

Categoria
A    250
B    800
Name: Vendas, dtype: int64

In [9]:
#Usando pelo nome
df_agrupado = df.groupby('Nome')['Vendas'].sum()
df_agrupado

Nome
Ana      150
Joao     550
Maria    100
Pedro    250
Name: Vendas, dtype: int64

In [10]:
#Metodo AGG permite aplicar varias funções de agregação aos grupos definidos pelo groupby. Podemos calcular diferentes métricas para cada grupo
#Ou ate mesmo aplicar funções personalizadas
#Vamos agora agrupar os dados por categoria e calcular a soma das vendas em cada categoria
df.groupby('Categoria').agg({'Vendas':sum})

C:\Users\Vitão\AppData\Local\Temp\ipykernel_30212\835724542.py:4: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.groupby('Categoria').agg({'Vendas':sum})

           Vendas
Categoria
A             250
B             800

In [12]:
#Criar agora tabela que possua soma das vendas, média e a maxima
df_agrupado_3=df.groupby('Categoria').agg({'Vendas':['sum', 'mean', 'max']})
df_agrupado_3

          Vendas
             sum        mean  max
Categoria
A            250  125.000000  150
B            800  266.666667  350

In [13]:
#Fazendo agora separado
grouped = df.groupby('Categoria')
grouped.agg(                          #Adicionando a media
    Total_vendas = ('Vendas', 'sum'), #Adicionando a media
    media_vendas = ('Vendas', 'mean'),#Adicionando o maximo
    maximo_vendas = ('Vendas','max')
    
)#Podemos fazer dessa forma para melhorar a visualização

           Total_vendas  media_vendas  maximo_vendas
Categoria
A                   250    125.000000            150
B                   800    266.666667            350

In [16]:
#Metodo pivot_table permite criar uma tabela dinamica onde linhas representam uma categoria, as colunas apresentam outra categoria
#e os valores sao agregados com base em uma terceira categoria
df_pivot = df.pivot_table(index='Categoria', columns='Nome', values='Vendas')

#Exibindo
df_pivot

Nome         Ana   Joao  Maria  Pedro
Categoria
A          150.0    NaN  100.0    NaN
B            NaN  275.0    NaN  250.0

In [17]:
#Metodo crosstab, cria uma tabela de frequencia cruzada
#Criando tabela cruzada com base em categoria e nome
df_cross = pd.crosstab(df['Categoria'], df['Nome']) #É como um contador cruzado
df_cross

Nome       Ana  Joao  Maria  Pedro
Categoria
A            1     0      1      0
B            0     2      0      1

In [18]:
#Metodo info fornece informações básicas sobre um dataframe
#Util quando se trata de um dataframe grande
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Nome       5 non-null      object
 1   Categoria  5 non-null      object
 2   Vendas     5 non-null      int64
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [19]:
#Metodo describe usando um novo dataframe
dados = {
    'Nome': ['Maria', 'Joao','Ana','Pedro'],
    'Idade':[25,32,28,40],
    'Vendas':[5000,3000,4500,6000]
}
df_salarios = pd.DataFrame(dados)
df_salarios.head()

    Nome  Idade  Vendas
0  Maria     25    5000
1   Joao     32    3000
2    Ana     28    4500
3  Pedro     40    6000

In [20]:
#Metodo describe sendo usado. é uma analise preliminar, muito comum usa-la sempre no começo ao analisar
df_salarios.describe()

       Idade  Vendas
count   4.00     4.0
mean   31.25  4625.0
std     6.50  1250.0
min    25.00  3000.0
25%    27.25  4125.0
50%    30.00  4750.0
75%    34.00  5250.0
max    40.00  6000.0

In [21]:
#Metodo transpose muda a representação da tabela
#Funciona bem com o describe
df_salarios.describe().transpose()

        count     mean     std     min      25%     50%     75%     max
Idade     4.0    31.25     6.5    25.0    27.25    30.0    34.0    40.0
Vendas    4.0  4625.00  1250.0  3000.0  4125.00  4750.0  5250.0  6000.0

In [22]:
df_salarios.transpose()

            0     1     2      3
Nome    Maria  Joao   Ana  Pedro
Idade      25    32    28     40
Vendas   5000  3000  4500   6000